Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Inc/py32e407_ll_lpuart.h
/** @defgroup LPUART_LL_EC_FIFOTHRESHOLD FIFO Threshold
  * @{
  */
#define LL_LPUART_FIFOTHRESHOLD_1_8        0x00000000U /*!< FIFO reaches 1/8 of its depth */
#define LL_LPUART_FIFOTHRESHOLD_1_4        0x00000001U /*!< FIFO reaches 1/4 of its depth */
#define LL_LPUART_FIFOTHRESHOLD_1_2        0x00000002U /*!< FIFO reaches 1/2 of its depth */
#define LL_LPUART_FIFOTHRESHOLD_3_4        0x00000003U /*!< FIFO reaches 3/4 of its depth */
#define LL_LPUART_FIFOTHRESHOLD_7_8        0x00000004U /*!< FIFO reaches 7/8 of its depth */
#define LL_LPUART_FIFOTHRESHOLD_8_8        0x00000005U /*!< FIFO becomes empty for TX and full for RX */
/**
  * @}
  */

/** @defgroup LPUART_LL_EC_DIRECTION Direction
  * @{
  */
#define LL_LPUART_DIRECTION_NONE           0x00000000U                        /*!< Transmitter and Receiver are disabled */
#define LL_LPUART_DIRECTION_RX             LPUART_CR1_RE                      /*!< Transmitter is disabled and Receiver is enabled */
#define LL_LPUART_DIRECTION_TX             LPUART_CR1_TE                      /*!< Transmitter is enabled and Receiver is disabled */
#define LL_LPUART_DIRECTION_TX_RX          (LPUART_CR1_TE |LPUART_CR1_RE)     /*!< Transmitter and Receiver are enabled */
/**
  * @}
  */

/** @defgroup LPUART_LL_EC_PARITY Parity Control
  * @{
  */
#define LL_LPUART_PARITY_NONE              0x00000000U                        /*!< Parity control disabled */
#define LL_LPUART_PARITY_EVEN              LPUART_CR1_PCE                     /*!< Parity control enabled and Even Parity is selected */
#define LL_LPUART_PARITY_ODD               (LPUART_CR1_PCE | LPUART_CR1_PS)   /*!< Parity control enabled and Odd Parity is selected */
/**
  * @}
  */

/** @defgroup LPUART_LL_EC_WAKEUP Wakeup
  * @{
  */
#define LL_LPUART_WAKEUP_IDLELINE          0x00000000U                        /*!<  LPUART wake up from Mute mode on Idle Line */
#define LL_LPUART_WAKEUP_ADDRESSMARK       LPUART_CR1_WAKE                    /*!<  LPUART wake up from Mute mode on Address Mark */
/**
  * @}
  */

/** @defgroup LPUART_LL_EC_DATAWIDTH Datawidth
  * @{
  */
#define LL_LPUART_DATAWIDTH_7B             LPUART_CR1_M1                       /*!< 7 bits word length : Start bit, 7 data bits, n stop bits */
#define LL_LPUART_DATAWIDTH_8B             0x00000000U                         /*!< 8 bits word length : Start bit, 8 data bits, n stop bits */
#define LL_LPUART_DATAWIDTH_9B             LPUART_CR1_M0                       /*!< 9 bits word length : Start bit, 9 data bits, n stop bits */
/**
  * @}
  */

/** @defgroup LPUART_LL_EC_PRESCALER Clock Source Prescaler
  * @{
  */
#define LL_LPUART_PRESCALER_DIV1            0x00000000U                                                                     /*!< Input clock not divided   */
#define LL_LPUART_PRESCALER_DIV2           (LPUART_PRESC_PRESCALER_0)                                                       /*!< Input clock divided by 2  */
#define LL_LPUART_PRESCALER_DIV4           (LPUART_PRESC_PRESCALER_1)                                                       /*!< Input clock divided by 4  */
#define LL_LPUART_PRESCALER_DIV6           (LPUART_PRESC_PRESCALER_1 | LPUART_PRESC_PRESCALER_0)                            /*!< Input clock divided by 6  */
#define LL_LPUART_PRESCALER_DIV8           (LPUART_PRESC_PRESCALER_2)                                                       /*!< Input clock divided by 8  */
#define LL_LPUART_PRESCALER_DIV10          (LPUART_PRESC_PRESCALER_2 | LPUART_PRESC_PRESCALER_0)                            /*!< Input clock divided by 10 */
#define LL_LPUART_PRESCALER_DIV12          (LPUART_PRESC_PRESCALER_2 | LPUART_PRESC_PRESCALER_1)                            /*!< Input clock divided by 12 */
#define LL_LPUART_PRESCALER_DIV16          (LPUART_PRESC_PRESCALER_2 | LPUART_PRESC_PRESCALER_1 | LPUART_PRESC_PRESCALER_0) /*!< Input clock divided by 16 */
#define LL_LPUART_PRESCALER_DIV32          (LPUART_PRESC_PRESCALER_3)                                                       /*!< Input clock divided by 32 */
#define LL_LPUART_PRESCALER_DIV64          (LPUART_PRESC_PRESCALER_3 | LPUART_PRESC_PRESCALER_0)                            /*!< Input clock divided by 64 */
#define LL_LPUART_PRESCALER_DIV128         (LPUART_PRESC_PRESCALER_3 | LPUART_PRESC_PRESCALER_1)                            /*!< Input clock divided by 128 */
#define LL_LPUART_PRESCALER_DIV256         (LPUART_PRESC_PRESCALER_3 | LPUART_PRESC_PRESCALER_1 | LPUART_PRESC_PRESCALER_0) /*!< Input clock divided by 256 */
/**
  * @}
  */

/** @defgroup LPUART_LL_EC_STOPBITS Stop Bits
  * @{
  */
#define LL_LPUART_STOPBITS_1               0x00000000U                        /*!< 1 stop bit */
#define LL_LPUART_STOPBITS_2               LPUART_CR2_STOP_1                  /*!< 2 stop bits */
/**
  * @}
  */

/** @defgroup LPUART_LL_EC_TXRX TX RX Pins Swap
  * @{
  */
#define LL_LPUART_TXRX_STANDARD            0x00000000U                        /*!< TX/RX pins are used as defined in standard pinout */
#define LL_LPUART_TXRX_SWAPPED             (LPUART_CR2_SWAP)                  /*!< TX and RX pins functions are swapped.             */
/**
  * @}
  */

/** @defgroup LPUART_LL_EC_RXPIN_LEVEL RX Pin Active Level Inversion
  * @{
  */
#define LL_LPUART_RXPIN_LEVEL_STANDARD     0x00000000U                        /*!< RX pin signal works using the standard logic levels */
#define LL_LPUART_RXPIN_LEVEL_INVERTED     (LPUART_CR2_RXINV)                 /*!< RX pin signal values are inverted.                  */
/**
  * @}
  */

/** @defgroup LPUART_LL_EC_TXPIN_LEVEL TX Pin Active Level Inversion
  * @{
  */
#define LL_LPUART_TXPIN_LEVEL_STANDARD     0x00000000U                        /*!< TX pin signal works using the standard logic levels */
#define LL_LPUART_TXPIN_LEVEL_INVERTED     (LPUART_CR2_TXINV)                 /*!< TX pin signal values are inverted.                  */
/**
  * @}
  */

/** @defgroup LPUART_LL_EC_BINARY_LOGIC Binary Data Inversion
  * @{
  */
#define LL_LPUART_BINARY_LOGIC_POSITIVE    0x00000000U                        /*!< Logical data from the data register are send/received in positive/direct logic. (1=H, 0=L) */
#define LL_LPUART_BINARY_LOGIC_NEGATIVE    LPUART_CR2_DATAINV                 /*!< Logical data from the data register are send/received in negative/inverse logic. (1=L, 0=H). The parity bit is also inverted. */
/**
  * @}
  */

/** @defgroup LPUART_LL_EC_BITORDER Bit Order
  * @{
  */
#define LL_LPUART_BITORDER_LSBFIRST        0x00000000U                        /*!< data is transmitted/received with data bit 0 first, following the start bit */
#define LL_LPUART_BITORDER_MSBFIRST        LPUART_CR2_MSBFIRST                /*!< data is transmitted/received with the MSB first, following the start bit */
/**
  * @}
  */

/** @defgroup LPUART_LL_TXOE_ALWAYS_ON Txoe Always On
  * @{
  */
#define LL_LPUART_TXOE_ALWAYS_ON_SOFTWARE  0x00000000U                        /*!< Hardware autonomous control output enables on/off */
#define LL_LPUART_TXOE_ALWAYS_ON_HARDWARE  LPUART_CR2_TXOE_ALWAYS_ON          /*!< The software control output enable is always on */
/**
  * @}
  */

/** @defgroup LPUART_LL_EC_ADDRESS_DETECT Address Length Detection
  * @{
  */
#define LL_LPUART_ADDRESS_DETECT_4B        0x00000000U                        /*!< 4-bit address detection method selected */
#define LL_LPUART_ADDRESS_DETECT_7B        LPUART_CR2_ADDM7                   /*!< 7-bit address detection (in 8-bit data mode) method selected */
/**
  * @}
  */

/** @defgroup LPUART_LL_EC_HWCONTROL Hardware Control
  * @{
  */
#define LL_LPUART_HWCONTROL_NONE           0x00000000U                         /*!< CTS and RTS hardware flow control disabled */
#define LL_LPUART_HWCONTROL_RTS            LPUART_CR3_RTSE                     /*!< RTS output enabled, data is only requested when there is space in the receive buffer */
#define LL_LPUART_HWCONTROL_CTS            LPUART_CR3_CTSE                     /*!< CTS mode enabled, data is only transmitted when the nCTS input is asserted (tied to 0) */
#define LL_LPUART_HWCONTROL_RTS_CTS        (LPUART_CR3_RTSE | LPUART_CR3_CTSE) /*!< CTS and RTS hardware flow control enabled */
/**
  * @}
  */

/** @defgroup LPUART_LL_EC_WAKEUP_ON Wakeup Activation
  * @{
  */
#define LL_LPUART_WAKEUP_ON_ADDRESS        0x00000000U                              /*!< Wake up active on address match */
#define LL_LPUART_WAKEUP_ON_STARTBIT       LPUART_CR3_WUS_1                         /*!< Wake up active on Start bit detection */
#define LL_LPUART_WAKEUP_ON_RXNE           (LPUART_CR3_WUS_0 | LPUART_CR3_WUS_1)    /*!< Wake up active on RXNE */
/**
  * @}
  */

/** @defgroup LPUART_LL_EC_DE_POLARITY Driver Enable Polarity
  * @{
  */
#define LL_LPUART_DE_POLARITY_HIGH         0x00000000U                        /*!< DE signal is active high */
#define LL_LPUART_DE_POLARITY_LOW          LPUART_CR3_DEP                     /*!< DE signal is active low */
/**
  * @}
  */

